# GetFabricationConnectorShape Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationConfiguration..::..GetFabricationConnectorShape Method
FabricationConfiguration Class See Also
---
Gets the fabrication connector shape from its identifier.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public ConnectorProfileType GetFabricationConnectorShape(
	int fabricationConnectorId
)
```

Visual Basic
---
```text
Public Function GetFabricationConnectorShape ( _
	fabricationConnectorId As Integer _
) As ConnectorProfileType
```

Visual C++
---
```text
public:
ConnectorProfileType GetFabricationConnectorShape(
	int fabricationConnectorId
)
```

# ### Parameters
fabricationConnectorId
    Type: System..::..Int32 The fabrication connector identifier.
# ### Return Value
The fabrication connector's shape.
# See Also
FabricationConfiguration Class
Autodesk.Revit.DB Namespace